# Pandas  
データ解析・加工ライブラリ

In [1]:
import pandas as pd
import numpy as np


---

## サンプルデータ  

「タイタニック号の乗客が生存したか」を予測する、有名なデータを使用  

- PassengerId：乗客識別ユニークID  
- Survived：生存フラグ（0=死亡、1=生存）  
- Pclass：チケットクラス  
  - 1：上層クラス（お金持ち）  
  - 2：中級クラス（一般階級）  
  - 3：下層クラス（労働階級）  
- Name：乗客の名前  
- Sex：性別（male=男性、female＝女性）  
- Age：年齢  
- SibSp：タイタニックに同乗している兄弟/配偶者の数  
- parch：タイタニックに同乗している親/子供の数  
- ticket：チケット番号  
- fare：料金  
- cabin：客室番号  
- Embarked：出港地（タイタニックへ乗った港）  
  - C = Cherbourg  
  - Q = Queenstown  
  - S = Southampton  


---

## csvファイル操作  
- ファイル読込  
- 先頭から5行を表示  
- データ項目・データ型を表示

In [2]:
df = pd.read_csv('./csv/titanic_train.csv')
display(df.head(5))
df.info()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- データ中身の概要を表示：件数、平均など

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200



---

## 特定の列を抽出  

- 1つ指定

In [4]:
col = df[['Name']]
display(col.head(5))

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In [5]:
print(col[0:5])
col[0:5]

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

- 複数指定

In [6]:
col = df[['Name', 'Age']]
display(col.head(5))

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [7]:
print(col[0:5])
col[0:5]

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0



---

## 条件を指定した抽出：query  

- 数値

In [8]:
col = df.query('Age < 20.')
display(col.head(5))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q

- 文字列

In [9]:
col = df.query('Name == "Braund, Mr. Owen Harris"')
display(col.head(5))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

### 抽出結果が1件のみで、特定のデータのみ取得したい場合  

- at：1つの要素しか抜き出すことができない

In [10]:
col = df.query('Name == "Braund, Mr. Owen Harris"')
item = col.at[0, 'Name']
print(item)

Braund, Mr. Owen Harris

- loc：行・列名を指定

In [11]:
col = df.query('Name == "Braund, Mr. Owen Harris"')
item = col.loc[:, 'Name'][0]
print(item)

Braund, Mr. Owen Harris

- iloc：インデックスを指定

In [12]:
col = df.query('Name == "Braund, Mr. Owen Harris"')
item = col.iloc[0, 3]
print(item)

Braund, Mr. Owen Harris



---

## 特定の列を抽出し、Numpyで配列化  
- 文字列

In [13]:
col = np.array(df['Name'])
print(col[0:5])
col[0:5]

['Braund, Mr. Owen Harris'
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'
 'Heikkinen, Miss. Laina' 'Futrelle, Mrs. Jacques Heath (Lily May Peel)'
 'Allen, Mr. William Henry']

array(['Braund, Mr. Owen Harris',
       'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
       'Heikkinen, Miss. Laina',
       'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
       'Allen, Mr. William Henry'], dtype=object)

- 抽出後、int型に変換

In [14]:
# 元データはfloat型
col = np.array(df['Age'])
print(col[0:5])

col = np.array(df['Age']).astype(int)
print(col[0:5])
col[0:5]

[22. 38. 26. 35. 35.]
[22 38 26 35 35]

array([22, 38, 26, 35, 35])


---

## 項目を追加  

- 項目「Add」を追加、初期値=0

In [15]:
col = df[['Name']]
col['Add'] = 0
display(col.head(5))

/tmp/ipykernel_539/2374746362.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  col['Add'] = 0

                                                Name  Add
0                            Braund, Mr. Owen Harris    0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    0
2                             Heikkinen, Miss. Laina    0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)    0
4                           Allen, Mr. William Henry    0

In [16]:
col = df[['Name']]
col = col.assign(Add=0)
display(col.head(5))

                                                Name  Add
0                            Braund, Mr. Owen Harris    0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    0
2                             Heikkinen, Miss. Laina    0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)    0
4                           Allen, Mr. William Henry    0


---

## ループ処理  

テストデータ

In [17]:
simple = pd.read_csv('./csv/simple.csv')
display(simple)
simple.info()

   Name  Age Comment
0   foo   19       A
1   bar   20     NaN
2  hoge   21       C

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Comment  2 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

- インデックス一覧

In [18]:
print(simple.index)
for index in simple.index:
    print(index)

RangeIndex(start=0, stop=3, step=1)
0
1
2

- 項目名一覧

In [19]:
for column_name in simple:
    print(column_name)

Name
Age
Comment

- 項目名とデータ一覧

In [20]:
for column_name, item in simple.iteritems():
    print(column_name)
    print(type(item))
    print(item)
    print('\n')

Name
<class 'pandas.core.series.Series'>
0     foo
1     bar
2    hoge
Name: Name, dtype: object


Age
<class 'pandas.core.series.Series'>
0    19
1    20
2    21
Name: Age, dtype: int64


Comment
<class 'pandas.core.series.Series'>
0      A
1    NaN
2      C
Name: Comment, dtype: object

- 項目名を指定し、データ一覧を抽出

In [21]:
for name in simple['Name']:
    print(name)

foo
bar
hoge

- `in zip()` で項目名を複数指定

In [22]:
for name, age in zip(simple['Name'], simple['Age']):
    print(name, age)

foo 19
bar 20
hoge 21

- インデックス名と行データ一覧

In [23]:
for index, row in simple.iterrows():
    print(index)
    print(type(row))
    print(row)
    print('\n')

0
<class 'pandas.core.series.Series'>
Name       foo
Age         19
Comment      A
Name: 0, dtype: object


1
<class 'pandas.core.series.Series'>
Name       bar
Age         20
Comment    NaN
Name: 1, dtype: object


2
<class 'pandas.core.series.Series'>
Name       hoge
Age          21
Comment       C
Name: 2, dtype: object

- 項目の一部を更新  
  - forで取得した項目：`row` はコピーデータのため、この値を変更しても反映されない  
  - `at`で元データの位置を指定し、更新すると反映される

In [24]:
for index, row in simple.iterrows():
    simple.at[index, 'Comment'] = row['Name']

for index, row in simple.iterrows():
    print(index)
    print(type(row))
    print(row)
    print('\n')

0
<class 'pandas.core.series.Series'>
Name       foo
Age         19
Comment    foo
Name: 0, dtype: object


1
<class 'pandas.core.series.Series'>
Name       bar
Age         20
Comment    bar
Name: 1, dtype: object


2
<class 'pandas.core.series.Series'>
Name       hoge
Age          21
Comment    hoge
Name: 2, dtype: object

In [25]:
for index in simple.index:
    simple.at[index, 'Comment'] = 'update'

for index, row in simple.iterrows():
    print(index)
    print(type(row))
    print(row)
    print('\n')

0
<class 'pandas.core.series.Series'>
Name          foo
Age            19
Comment    update
Name: 0, dtype: object


1
<class 'pandas.core.series.Series'>
Name          bar
Age            20
Comment    update
Name: 1, dtype: object


2
<class 'pandas.core.series.Series'>
Name         hoge
Age            21
Comment    update
Name: 2, dtype: object

- インデックス名と行データの一覧を、タプル型で表示 → iterrows()よりも高速

In [26]:
for row in simple.itertuples():
    print(type(row))
    print(row)
    print('\n')

<class 'pandas.core.frame.Pandas'>
Pandas(Index=0, Name='foo', Age=19, Comment='update')


<class 'pandas.core.frame.Pandas'>
Pandas(Index=1, Name='bar', Age=20, Comment='update')


<class 'pandas.core.frame.Pandas'>
Pandas(Index=2, Name='hoge', Age=21, Comment='update')

In [27]:
for row in simple.itertuples(name=None):
    print(type(row))
    print(row)
    print('\n')

<class 'tuple'>
(0, 'foo', 19, 'update')


<class 'tuple'>
(1, 'bar', 20, 'update')


<class 'tuple'>
(2, 'hoge', 21, 'update')


---

## ループ処理・項目を追加  

元データに項目(列)を追加し、別名で保存  
追加する項目が2行以上存在する場合は、元データの行も追加する  


例）追加する項目が2行の場合  
- 元データ(=Key情報)：ユーザA, ユーザB  
- 追加する項目：行1, 行2  
- 別名で保存したデータ(結果)  
  - ユーザA + 行1  
  - ユーザA + 行2  
  - ユーザB + 行1  
  - ユーザB + 行2  


---

### 元データ  

csvファイル

In [28]:
simple = pd.read_csv('./csv/simple.csv')
display(simple)
simple.info()

   Name  Age Comment
0   foo   19       A
1   bar   20     NaN
2  hoge   21       C

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Comment  2 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

### 追加するデータ  

dict型で管理  

- dict01： 配列なし、1列  
- dict02： 配列なし、2列  
- dict11： 配列あり、1行・1列  
- dict12： 配列あり、1行・2列  
- dict21： 配列あり、2行・1列 → 元データの行を追加  
- dict22： 配列あり、2行・2列 → 元データの行を追加

In [29]:
dict01 = {
    'key1' : 'A1'
}

dict02 = {
    'key1' : 'A1',
    'key2' : 'A2'
}

dict11 = [
  {
    'key1' : 'A1'
  }
]

dict12 = [
  {
    'key1' : 'A1',
    'key2' : 'A2'
  }
]

dict21 = [
  {
    'key1' : 'A1'
  },
  {
    'key1' : 'B1'
  }
]

dict22 = [
  {
    'key1' : 'A1',
    'key2' : 'A2'
  },
  {
    'key1' : 'B1',
    'key2' : 'B2'
  }
]

項目を追加  


- dict01： 配列なし、1列

In [30]:
# 元データをコピー → 項目追加
dfnew = simple.copy()
for index, row in dfnew.iterrows():
    dfnew.at[index, 'key1'] = dict01['key1']

display(dfnew)
dfnew.info()

   Name  Age Comment key1
0   foo   19       A   A1
1   bar   20     NaN   A1
2  hoge   21       C   A1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Comment  2 non-null      object
 3   key1     3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

- dict02： 配列なし、2列

In [31]:
dfnew = simple.copy()
for index, row in dfnew.iterrows():
    dfnew.at[index, 'key1'] = dict02['key1']
    dfnew.at[index, 'key2'] = dict02['key2']

display(dfnew)
dfnew.info()

   Name  Age Comment key1 key2
0   foo   19       A   A1   A2
1   bar   20     NaN   A1   A2
2  hoge   21       C   A1   A2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Comment  2 non-null      object
 3   key1     3 non-null      object
 4   key2     3 non-null      object
dtypes: int64(1), object(4)
memory usage: 248.0+ bytes

- dict11： 配列あり、1行・1列

In [32]:
dfnew = simple.copy()
for index, row in dfnew.iterrows():
    for i in dict11:
        dfnew.at[index, 'key1'] = i['key1']

display(dfnew)
dfnew.info()

   Name  Age Comment key1
0   foo   19       A   A1
1   bar   20     NaN   A1
2  hoge   21       C   A1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Comment  2 non-null      object
 3   key1     3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

- dict12： 配列あり、1行・2列

In [33]:
dfnew = simple.copy()
for index, row in dfnew.iterrows():
    for i in dict12:
        dfnew.at[index, 'key1'] = i['key1']
        dfnew.at[index, 'key2'] = i['key2']

display(dfnew)
dfnew.info()

   Name  Age Comment key1 key2
0   foo   19       A   A1   A2
1   bar   20     NaN   A1   A2
2  hoge   21       C   A1   A2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Comment  2 non-null      object
 3   key1     3 non-null      object
 4   key2     3 non-null      object
dtypes: int64(1), object(4)
memory usage: 248.0+ bytes

- dict21： 配列あり、2行・1列 → 元データの行を追加

In [34]:
# 空のデータフレームを作成 → 行を追加
dfnew = pd.DataFrame(columns=['Name', 'Age', 'Comment', 'key1'])

# 元データを読込
for index, row in simple.iterrows():
    # 行を追加
    for i in dict21:
        dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1']}, ignore_index=True)

display(dfnew)
dfnew.info()

/tmp/ipykernel_539/4033219997.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1']}, ignore_index=True)
/tmp/ipykernel_539/4033219997.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1']}, ignore_index=True)
/tmp/ipykernel_539/4033219997.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1']}, ignore_index=True)
/tmp/ipykernel_539/4033219997.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1']}, ignore_index=True)
/tmp/ipykernel_539/4033219997.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1']}, ignore_index=True)
/tmp/ipykernel_539/4033219997.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1']}, ignore_index=True)

   Name Age Comment key1
0   foo  19       A   A1
1   foo  19       A   B1
2   bar  20     NaN   A1
3   bar  20     NaN   B1
4  hoge  21       C   A1
5  hoge  21       C   B1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      object
 2   Comment  4 non-null      object
 3   key1     6 non-null      object
dtypes: object(4)
memory usage: 320.0+ bytes

- dict22： 配列あり、2行・2列 → 元データの行を追加

In [35]:
dfnew = pd.DataFrame(columns=['Name', 'Age', 'Comment', 'key1', 'key2'])
for index, row in simple.iterrows():
    for i in dict22:
        dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1'], 'key2': i['key2']}, ignore_index=True)

display(dfnew)
dfnew.info()

/tmp/ipykernel_539/3950994986.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1'], 'key2': i['key2']}, ignore_index=True)
/tmp/ipykernel_539/3950994986.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1'], 'key2': i['key2']}, ignore_index=True)
/tmp/ipykernel_539/3950994986.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1'], 'key2': i['key2']}, ignore_index=True)
/tmp/ipykernel_539/3950994986.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1'], 'key2': i['key2']}, ignore_index=True)
/tmp/ipykernel_539/3950994986.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1'], 'key2': i['key2']}, ignore_index=True)
/tmp/ipykernel_539/3950994986.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dfnew = dfnew.append({'Name': row['Name'], 'Age': row['Age'], 'Comment': row['Comment'], 'key1': i['key1'], 'key2': i['key2']}, ignore_index=True)

   Name Age Comment key1 key2
0   foo  19       A   A1   A2
1   foo  19       A   B1   B2
2   bar  20     NaN   A1   A2
3   bar  20     NaN   B1   B2
4  hoge  21       C   A1   A2
5  hoge  21       C   B1   B2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      object
 2   Comment  4 non-null      object
 3   key1     6 non-null      object
 4   key2     6 non-null      object
dtypes: object(5)
memory usage: 368.0+ bytes

### 別名で保存

In [36]:
dfnew.to_csv('./csv/simple_add.csv')



---

## 値が設定されていないデータを除外  

テストデータ

In [37]:
simple = pd.read_csv('./csv/simple.csv')
display(simple)
simple.info()

   Name  Age Comment
0   foo   19       A
1   bar   20     NaN
2  hoge   21       C

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Comment  2 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

- Comment欄のみ抽出

In [38]:
col = simple[['Comment']]
display(col)

  Comment
0       A
1     NaN
2       C

- 値が設定されていない(NaN)行を除外  
  `dropna()` の場合、元データは削除されないため、別名で保存する

In [39]:
col.dropna()

  Comment
0       A
2       C

In [40]:
display(col)

  Comment
0       A
1     NaN
2       C

In [41]:
d = col.dropna()

In [42]:
display(d)

  Comment
0       A
2       C

In [43]:
display(col)

  Comment
0       A
1     NaN
2       C

- 値が設定されていない行を除外  
  元のデータを削除して良い場合は、`inplace=True` を指定する

In [44]:
col.dropna(inplace=True)
display(col)

/tmp/ipykernel_539/44562958.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  col.dropna(inplace=True)

  Comment
0       A
2       C

In [45]:
display(col)

  Comment
0       A
2       C



---

## 欠損データを補正  

- 欠損データの有無を確認

In [46]:
def kesson_table(df): 
        null_val = df.isnull().sum()
        percent = 100 * df.isnull().sum()/len(df)
        kesson_table = pd.concat([null_val, percent], axis=1)
        kesson_table_ren_columns = kesson_table.rename(
        columns = {0 : '欠損数', 1 : '%'})
        return kesson_table_ren_columns

In [47]:
kesson_table(df)

             欠損数          %
PassengerId    0   0.000000
Survived       0   0.000000
Pclass         0   0.000000
Name           0   0.000000
Sex            0   0.000000
Age          177  19.865320
SibSp          0   0.000000
Parch          0   0.000000
Ticket         0   0.000000
Fare           0   0.000000
Cabin        687  77.104377
Embarked       2   0.224467

代替データを設定  

- Age, Fare：全データの中央値を設定  
- Embarked：一番多いデータ「S」を設定  
- Cabin：未使用のため何もしない

In [48]:
df['Age'] = df['Age'].fillna(df['Age'].median())
df['Embarked'] = df['Embarked'].fillna('S')
kesson_table(df)

             欠損数          %
PassengerId    0   0.000000
Survived       0   0.000000
Pclass         0   0.000000
Name           0   0.000000
Sex            0   0.000000
Age            0   0.000000
SibSp          0   0.000000
Parch          0   0.000000
Ticket         0   0.000000
Fare           0   0.000000
Cabin        687  77.104377
Embarked       0   0.000000

文字データを数値に変換  

- Sex  
  - male：0  
  - female:1  
- Embarked  
  - S：0  
  - C：1  
  - Q：2

In [49]:
df['Sex'][df['Sex'] == 'male'] = 0
df['Sex'][df['Sex'] == 'female'] = 1
df['Embarked'][df['Embarked'] == 'S' ] = 0
df['Embarked'][df['Embarked'] == 'C' ] = 1
df['Embarked'][df['Embarked'] == 'Q'] = 2
df.head(5)

/tmp/ipykernel_539/4064791259.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Sex'][df['Sex'] == 'male'] = 0
/tmp/ipykernel_539/4064791259.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Sex'][df['Sex'] == 'female'] = 1
/tmp/ipykernel_539/4064791259.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Embarked'][df['Embarked'] == 'S' ] = 0
/tmp/ipykernel_539/4064791259.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Embarked'][df['Embarked'] == 'C' ] = 1
/tmp/ipykernel_539/4064791259.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Embarked'][df['Embarked'] == 'Q'] = 2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0



---

## 補正したcsvを別名で保存

In [50]:
df.to_csv('./csv/titanic_train_edit.csv')



---